import image0 from '../assets/products/0.jpg'
import image1 from '../assets/products/1.webp';
import image2 from '../assets/products/2.webp';
import image3 from '../assets/products/3.webp';
import image4 from '../assets/products/4.webp';
import image5 from '../assets/products/5.webp';
import image6 from '../assets/products/6.webp';
import image7 from '../assets/products/7.webp';
import image8 from '../assets/products/8.webp';
import image9 from '../assets/products/9.webp';
import image10 from '../assets/products/10.jpg';
import image11 from '../assets/products/11.jpg';
import image12 from '../assets/products/12.jpg';
import image13 from '../assets/products/13.png';
import image14 from '../assets/products/14.png';
import image15 from '../assets/products/15.jpeg'

import { ref } from 'vue';

export const items = ref([
    { 
        image: image0, 
        name: 'Canon PowerShot G7 X Mark III', 
        price: '130.000', 
        desc: `Бренд: Canon  
        Тип фотоаппарата: Компактный с несменной оптикой  
        Объектив в комплекте: Есть  
        Число эффективных мегапикселей: 20.1  
        Тип матрицы: CMOS, 1" (13.2 x 8.8 мм)  
        Максимальное разрешение фото: 5472 x 3648  
        ISO: 125–12800 (расширяемый до 25600)  
        Скорость съемки: 20 кадров/с  
        Видео: 4K (3840 x 2160), 120 кадров/с  
        Экран: Сенсорный поворотный, 3 дюйма, 1,04 млн точек  
        Видоискатель: Отсутствует (использование экрана в качестве видоискателя)  
        Разъемы: USB (с поддержкой зарядки), HDMI, Bluetooth, Wi-Fi  
        Вспышка: Встроенная, до 7 м, подавление эффекта красных глаз  
        Дополнительные функции: Крепление для штатива, дистанционное управление, датчик ориентации  
        Формат записи видео: MP4  
        Тип карт памяти: SD, SDHC, SDXC  
        Вес: 304 г  
        Гарантия: 12 месяцев от магазина` 
    },
    { 
        image: image1, 
        name: 'Canon EOS R50 Kit RF-S 18-45mm IS STM', 
        price: '85.000', 
        desc: `Бренд: Canon  
        Тип фотоаппарата: Беззеркальная со сменной оптикой  
        Комплект: RF-S 18-45mm F4.5-6.3 IS STM  
        Объектив в комплекте: Есть  
        Название объектива: RF-S 18-45mm f/4.5-6.3 IS STM  
        Байонет: Canon RF  
        Стабилизатор изображения: Оптический  
        Число эффективных мегапикселей: 24.2  
        Тип матрицы: CMOS, APS-C (22.3 х 14.9 мм), кроп-фактор 1.6  
        ISO: 100–32000 (расширяемый до 51200)  
        Скорость съемки: 12 кадров/с  
        Экран: Поворотный сенсорный, 2.95 дюйма, 1,62 млн точек  
        Видоискатель: Электронный, 100% поле зрения, 2,36 млн пикселей  
        Разъемы: USB Type-C, micro-HDMI, Bluetooth, Wi-Fi  
        Вес: 328 г` 
    },
    { 
        image: image2, 
        name: 'Canon EOS R6 Mark II Body', 
        price: '190.000', 
        desc: `Бренд: Canon  
        Тип фотоаппарата: Беззеркальная со сменной оптикой  
        Байонет: Canon RF  
        Стабилизатор изображения: Сдвиг матрицы  
        Число эффективных мегапикселей: 24.2  
        Тип матрицы: CMOS, Full Frame (36 x 24 мм), кроп-фактор 1  
        ISO: 100–102400 (расширяемый до 204800)  
        Скорость съемки: 40 кадров/с  
        Выдержка: от 1/8000 до 30 секунд  
        Экран: Поворотный сенсорный, 3 дюйма, 1,62 млн точек  
        Видоискатель: Электронный, 100% поле зрения, 3,69 млн пикселей  
        Разъемы: USB 3.2, Bluetooth, HDMI, Wi-Fi, вход для микрофона и наушников  
        Вес (с батареей): 680 г` 
    },
    { 
        image: image3, 
        name: 'Canon EOS 250D Kit 18-55 IS STM Black', 
        price: '69.000', 
        desc: `Бренд: Canon  
        Тип фотоаппарата: Зеркальный  
        Комплект: 18-55 IS STM  
        Объектив в комплекте: Есть  
        Матрица: APS-C, 24.1 Мп, кроп-фактор 1.6  
        ISO: 100–25600  
        Скорость съемки: 5 кадров/с  
        Экран: Поворотный сенсорный, 3 дюйма  
        Разъемы: HDMI, USB, Wi-Fi, Bluetooth  
        Вес: 449 г` 
    },
    { 
        image: image4, 
        name: 'Canon EOS 5D Mark IV Body', 
        price: '156.000', 
        desc: `Бренд: Canon  
        Тип фотоаппарата: Зеркальный  
        Матрица: Full Frame, 30.4 Мп  
        ISO: 100–32000 (расширяемый до 102400)  
        Скорость съемки: 7 кадров/с  
        Экран: Сенсорный, 3.2 дюйма, 1.62 млн точек  
        Видоискатель: Оптический  
        Разъемы: USB 3.0, HDMI, Wi-Fi, GPS  
        Вес: 890 г` 
    },
    { 
        image: image5, 
        name: 'Sony Alpha A6700 Body', 
        price: '149.000', 
        desc: `Бренд: Sony  
        Тип фотоаппарата: Беззеркальная со сменной оптикой  
        Матрица: APS-C, 26 Мп  
        ISO: 100–32000 (расширяемый до 51200)  
        Скорость съемки:  11 кадров/с  
        Экран: Поворотный сенсорный, 3 дюйма  
        Видоискатель: Электронный, 2.36 млн точек  
        Разъемы: USB Type-C, HDMI, Wi-Fi, Bluetooth  
        Вес: 493 г` 
    },
    { 
        image: image6, 
        name: 'Sony Alpha ILCE-7M3 Kit 28-70 OSS', 
        price: '193.000', 
        desc: `Бренд: Sony  
        Тип фотоаппарата: Беззеркальная со сменной оптикой  
        Комплект: 28-70mm f/3.5-5.6 OSS  
        Матрица: Full Frame, 24.2 Мп  
        ISO: 100–51200 (расширяемый до 204800)  
        Скорость съемки: 10 кадров/с  
        Экран: Поворотный, 3 дюйма  
        Видоискатель: Электронный, 2.36 млн точек  
        Разъемы: USB Type-C, HDMI, Wi-Fi, Bluetooth  
        Вес: 650 г` 
    },
    { 
        image: image7, 
        name: 'Sony Alpha ILCE-7M4 Body', 
        price: '201.000', 
        desc: `Бренд: Sony  
        Тип фотоаппарата: Беззеркальная со сменной оптикой  
        Матрица: Full Frame, 33 Мп  
        ISO: 100–51200 (расширяемый до 204800)  
        Скорость съемки: 10 кадров/с  
        Экран: Поворотный сенсорный, 3 дюйма  
        Видоискатель: Электронный, 3.69 млн точек  
        Разъемы: USB Type-C, HDMI, Wi-Fi, Bluetooth  
        Вес: 658 г` 
    },
    { 
        image: image8, 
        name: 'DJI Osmo Pocket 3 Creator Combo', 
        price: '72.000', 
        desc: `Тип устройства: Экшн-камера  
        Разрешение видео: 4K  
        Стабилизация: Трехосевая  
        Форматы записи: MP4  
        Экран: Сенсорный  
        Разъемы: USB Type-C  
        Вес: 116 г` 
    },
    { 
        image: image9, 
        name: 'DJI Mini 4K', 
        price: '40.000', 
        desc: `Тип устройства: Квадрокоптер  
        Разрешение видео: 4K  
        Время полета: До 31 минуты  
        Дальность полета: До 10 км  
        Стабилизация: Трехосевая` 
    },
    { 
        image: image10, 
        name: 'DJI Mini 3 Pro', 
        price: '99.000', 
        desc: `Тип устройства: Квадрокоптер  
        Разрешение видео: 4K  
        Время полета: До 34 минут  
        Дальность полета: До 12 км  
        Стабилизация камеры: Трехосевая  
        Вес: 249 г` 
    },
    { 
        image: image11, 
        name: 'DJI Mavic 3 Pro', 
        price: '270.000', 
        desc: `Тип устройства: Квадрокоптер  
        Камера: Hasselblad, 4K  
        Время полета: До 46 минут  
        Дальность полета: До 15 км  
        Стабилизация камеры: Трехосевая  
        Вес: 895 г` 
    },
    { 
        image: image12, 
        name: 'DJI Mavic 3 Classic (только дрон)', 
        price: '120.000', 
        desc: `Тип устройства: Квадрокоптер  
        Камера: Hasselblad, 4K  
        Время полета: До 46 минут  
        Дальность полета: До 15 км  
        Стабилизация камеры: Трехосевая  
        Вес: 895 г` 
    },
    { 
        image: image13, 
        name: '"Ромашка-6" РЭБ', 
        price: '190.000', 
        desc: `Тип устройства: Радиоэлектронная борьба (РЭБ)  
        Назначение: Для автомобилей  
        Функции: Подавление радиосигналов  
        Комплектация: Интеграция с автомобильными системами` 
    },
    { 
        image: image14, 
        name: '«Ромашка-4» РЭБ', 
        price: '130.000', 
        desc: `Тип устройства: Радиоэлектронная борьба (РЭБ)  
        Назначение: Для автомобилей  
        Функции: Подавление радиосигналов дронов  
        Количество каналов: 4  
        Дальность подавления: До 300 метров  
        Комплектация: Интеграция с автомобильными системами  
        Особенности: Компактный дизайн, простота установки` 
    },
    { 
        image: image15, 
        name: '«Ромашка-8» РЭБ', 
        price: '270.000', 
        desc: `Тип устройства: Радиоэлектронная борьба (РЭБ)  
        Назначение: Для автомобилей  
        Функции: Подавление радиосигналов дронов  
        Количество каналов: 8  
        Дальность подавления: До 500 метров  
        Комплектация: Интеграция с автомобильными системами  
        Особенности: Высокая эффективность, поддержка нескольких частотных диапазонов` 
    },
]);